const config = {
  secretKey: '123', //存档密钥
  lvUpNeedExp: [ //当前等级  所需总经验  升到下一级所需经验
    [1, 0, 230],
    [2, 230, 370],
    [3, 600, 480],
    [4, 1080, 580],
    [5, 1660, 600],
    [6, 2260, 720],
    [7, 2980, 750],
    [8, 3730, 890],
    [9, 4620, 930],
    [10, 5550, 970],
    [11, 6520, 1010],
    [12, 7530, 1050],
    [13, 8580, 1225],
    [14, 9805, 1250],
    [15, 11055, 1275],
    [16, 12330, 1300],
    [17, 13630, 1325],
    [18, 14955, 1500],
    [19, 16455, 1590],
    [20, 18045, 1600],
    [21, 19645, 1850],
    [22, 21495, 2100],
    [23, 23595, 2350],
    [24, 25945, 2600],
    [25, 28545, 3500],
    [26, 32045, 4500],
    [27, 36545, 5500],
    [28, 42045, 6500],
    [29, 48545, 7500],
    [30, 56045, 0]
  ],
  unitTypes: [{ //单位类型 有部分属性对不同单位类型计算结果不同
    name: "玩家单位",
    code: 1
  }, {
    name: "英雄单位",
    code: 2
  }, {
    name: "精英单位",
    code: 3
  }, {
    name: "普通单位",
    code: 4
  }],
  configEquiQuality: [{
    name: '普通',
    qualityCoefficient: 0.8,
    color: '#fff',
    extraEntryNum: 1,
  }, {
    name: '稀有',
    qualityCoefficient: 1,
    color: '#0095ff',
    extraEntryNum: 2,
  }, {
    name: '史诗',
    qualityCoefficient: 1.15,
    color: '#ff00ff',
    extraEntryNum: 3,
  }, {
    name: '唯一',
    qualityCoefficient: 1.3,
    color: '#f78918',
    extraEntryNum: 3,
  }],

  //不同的单位类型爆出的装备概率，依次为普通，稀有，史诗，唯一
  configEquiOutputProbability: {
    2: [0, 1, 1, 1],
    3: [1, 1, 0.5, 0.2],
    4: [1, 10.2, 10.08, 10],
  },

  //对应额外词条数值的影响常数，越高给予的数值越多
  ATK_C: 1, //攻击力
  HP_C: 4,  //生命值
  ARMOR_C: 0.15, //护甲
  EVADE_C: 0.10, //闪避
  ARP_C: 0.2, //无视护甲
  CRIT_C: 0.15, //暴击几率
  CRITDMG_C: 0.4, //暴击伤害
  HPRS_C: 0.1, //每秒生命恢复
  HPSTEAL_C: 0.1, //生命偷取
  ATKSP_C: 1, //攻击速度加成
}