const config = {
  secretKey: '123',
  lvUpNeedExp: [
    [1, 0, 230],
    [2, 230, 370],
    [3, 600, 480],
    [4, 1080, 580],
    [5, 1660, 600],
    [6, 2260, 720],
    [7, 2980, 750],
    [8, 3730, 890],
    [9, 4620, 930],
    [10, 5550, 970],
    [11, 6520, 1010],
    [12, 7530, 1050],
    [13, 8580, 1225],
    [14, 9805, 1250],
    [15, 11055, 1275],
    [16, 12330, 1300],
    [17, 13630, 1325],
    [18, 14955, 1500],
    [19, 16455, 1590],
    [20, 18045, 1600],
    [21, 19645, 1850],
    [22, 21495, 2100],
    [23, 23595, 2350],
    [24, 25945, 2600],
    [25, 28545, 3500],
    [26, 32045, 4500],
    [27, 36545, 5500],
    [28, 42045, 6500],
    [29, 48545, 7500],
    [30, 56045, 0]
  ],
  playerAttribute: {
    name: 'player',
    unitType: {
      name: "英雄单位",
      code: 1
    },
    //一级属性
    MAXHP: 100,
    CURHP: 100,
    ATK: 10, //攻击力
    ARMOR: 2, //护甲
    EVADE: 0.5, //闪避
    ATKSPEED: 1.5, //每秒攻击次数
    ATKSI: 0.6, //基础攻击间隔
    ARP: 1, //穿甲
    CRIT: 0.3, //暴击几率
    CRITDMG: 1.5, //暴击伤害
    HPRS: 1, //每秒生命恢复
    HPSTEAL: 0, //生命偷取
    // 二级属性
    ATKSP: 0, //攻击速度加成
    //人物属性
    EXP: 0,
    EXPNL: 100, //升到下一级需要的经验
    LV: 1,
  },
  monsterAttribute: {
    type: 'monster',
    unitType: {
      name: "普通单位",
      code: 3
    },
    MAXHP: 20000,
    CURHP: 20000,
    ATK: 800,
    ARMOR: 200,
    EVADE: 0,
    ATKSPEED: 1,
    ARP: 1,
    CRIT: 0,
    CRITDMG: 1.5,
  },
  unitType: [{
    name: "英雄单位",
    code: 1
  }, {
    name: "精英单位",
    code: 2
  }, {
    name: "普通单位",
    code: 3
  }]
}